
document.addEventListener("DOMContentLoaded", () => {
    const langContainer = document.querySelector("[data-js-lang-container]");
    const mainButton = langContainer.querySelector("[data-js-lang-main]");
    const dropdown = langContainer.querySelector("[data-js-lang-dropdown]");
    const langButtons = dropdown.querySelectorAll(".lang-btn");
  
    const translations = {
        ru: {
          //* header
          theory: "«Теория»",
          practice: "«Практика»",
          classification: "Классификация стресса",
          forms: "Формы стресса",
          types: "Виды стрессоров",
          stages: "Стадии приспособления к стрессу",
          phases: "Фазы стресса",
          info: "Общая информация о стрессе и методиках",
          stressors: "Виды стрессоров",
          adaptation: "Cтадии приспособлении к стрессу",

          //* section 1
          influence: "ВЛИЯНИЕ СТРЕССОВ НА ОРГАНИЗМ ЧЕЛОВЕКА",
          aboutstress: "Что такое стресс?",
          aboutstressinfo:"Под стрессом (напряжением) понимается совокупность неспецифических адаптационных реакций организма на воздействие различных неблагоприятных факторов (физических или психологических). Все процессы в организме человека поддаются психоэмоциональному состоянию. Появление стресса в организме человека нарушается гомеостаз, состояние нервной системы и т.д.",
          hans:"ИССЛЕДОВАНИЯ ГАНСА СЕЛЬЕ",
          selye:"Благодаря наблюдениям Ганса Селье  появился термин «Теория  биологического стресса». Модель общего адаптационного синдрома Ганса Селье представляет объяснение того, как организм реагирует на стрессор и приспосабливается к стрессу. В своих исследованиях Селье отметил, что с биологической точки зрения организм приспосабливается к внешним стресорам, чтобы восстановить и сохранить гомеостаз. Для того чтобы, сохранить внутренний баланс, организм активирует гуморальную систему, которая помогает справится со стрессом. Основной задачей общего адаптационного синдрома является борьба организма со стрессом. Еще одним результата анализа Селье является доказательство того, что стрессовые реакции имеют свои пределы. Когда организм часто подвергается стрессу запасы энергии для борьбы со стрессорами уменьшаются, тем самым приводят организм к истощению.",
          classificationofstress: "Классификация стресса",
          everydaystress: "Повседневный стресс",
          everydaystressto:"реакция организма на мелкие события в повседневной жизни",
          emotionalstress: "Эмоциональный стресс",
          emotionalstressto:"ответная реакция на перенапряжение нервной системы",
          occupationalstress:"Профессиональный стресс",
          occupationalstressto: "многообразный феномен, выражающийся в психологических или физических реакциях на напряженные ситуации в трудовой деятельности",
          informationstress: "Информационный стресс",
          informationstressto: "состояние, которое возникает в результате информационных нагрузок",

          //* section2
          formsofstress:"Формы стресса",
          formsofstressto:"В медицине, физиологии, психологии выделяют положительную (эустресс) и отрицательную (дистресс) формы стресса",
          Eustress:"Эустресс",
          Eustressto:"полезный стресс. Стресс может быть полезным, если он тонизирует работу организма и способствует мобилизации защитных сил Примерами включают подготовку к важному событию, такому как экзамен или выступление, которое несмотря на определенное напряжение, приносит удовольствие и радость от конечного итога. Эустресс, как правило, краткосрочен и исчезает после завершения стресса, оставляя позитивные последствия",
          Distress:"Дистресс",
          Distressto:"вредный, негативный тип стресса, с которым организм человека не в силах справиться. Он разрушает моральное здоровье человека и даже может привести к тяжелым психическим заболеваниям. Этот вид связан с ситуациями, которые воспринимаются как угрозы, и негативно влияют на физическое и психическое здоровье. Примеры включают хронические проблемы на работе, конфликты в личных отношениях, финансовые трудности или серьезные болезни. В обиходной речи, когда говорят, что человек испытывает стресс, обычно имеют в виду чрезмерный стресс, или дистресс. При этом стресс – это реакция на стрессор(Воздействия, вызывающие стресс,) чрезвычайный раздражитель, а не на любой раздражитель вообще.",

          //* section 3
          Typesofstressors:"Виды стрессоров",
          Typesofstressorsto:"Различают физиологические и психологические стрессоры",
          Physiologicalstressors:"Физиологические стрессоры",
          Physiologicalstressorsto:"оказывают непосредственное действие на ткани тела. К ним относятся болевые воздействия, холод, высокая температура, чрезмерная физическая нагрузка и др.",
          Biological:"Биологический (физиологический стресс)",
          Biologicalto:"характеризуется нарушением гомеостаза и вызывается непосредственным действием неблагоприятного стимула на организм. Среди факторов, их вызывающих, наиболее известны голод, гипотермия, жажда, нарушения кровообращения, дыхания, функции нервной системы и т.д.",
          Psychologicalstressors:"Психологические стрессоры",
          Psychologicalstressorsto:"это стимулы, которые сигнализируют о биологической или социальной значимости событий. Это сигналы угрозы, опасности, переживания, обиды, необходимость решения сложной задачи.",
          Psychologicalstress:"Психологический стресс",
          Psychologicalstressto:"реакция человека на особенности взаимодействия между личностью и окружающим миром работах (по Р. Лазаруса, Р. Ланьер). Психологический стресс вызывается сигнальными раздражителями. Он появляется в ситуации угрозы, обиды и др., а также в условиях так называемых конфликтных ситуаций, в которых животное и человек длительное время не могут удовлетворить свои биологические или социальные потребности.",

          //* section 4
          Observations:"Наблюдения Ганса Селье",
          Observationsto:"И стадии приспособлении к стрессу.",
          Observationstoo:"Благодаря наблюдениям Ганса Селье появился термин «Теория биологического стресса». Модель общего адаптационного синдрома Ганса Селье представляет объяснение того, как организм реагирует на стрессор и приспосабливается к стрессу. В своих исследованиях Селье отметил, что с биологической точки зрения организм приспосабливается к внешним стресорам, чтобы восстановить и сохранить гомеостаз. В биологической адаптации, то есть в приспособлении к стрессу, можно выделить три стадии.",
          Stageone:"Стадия первая",
          Stageonee:"Стадия тревоги",
          Stageoneee:"На этой стадии организм сталкивается с неким неспецифичным фактором и старается приспособиться к нему. Включается режим опасности: слишком холодно, слишком страшно, больно, опасно и пр. Затем организм мобилизуется, включаются механизмы саморегуляции. Если защитные реакции эффективны и влияние стрессора снижается или прекращается, то организм возвращается в нормальное состояние, тревога утихает. Большинство стрессов разрешается на этой стадии.",
          Stagetwo:"Стадия вторая",
          Stagetwoo:"Стадия адаптации.",
          Stagetwooo:"Происходит адаптация к новым условиям. Эта стадия наступает при продолжительном воздействии стрессора, когда возникает необходимость поддержания защитных реакций организма. Происходит сбалансированное расходование адаптационных резервов. На этой стадии человек способен анализировать и искать оптимальные пути выхода из ситуации.",
          Stagethree:"Стадия трётья",
          Stagethreee:"Стадия истощения.",
          Stagethreeee:"Если стрессор действует длительное время, происходит истощение гормональных ресурсов и разрушение систем адаптации. Сопротивляемость организма существенно снижается. На этой стадии и проявляются болезни, вызванные стрессом.",

          //* section 5
          Stressphases:"Фазы стресса (анаболическа и катаболическая)",
          Stressphasesto:"Катаболическая и анаболическая фазы относятся к метаболическим процессам, которые организм запускает в ответ на стрессовую ситуацию. Катаболическая фаза характерна разрушением, в то время как анаболическая восстановлением.",
          Stressphasestoo:"Для того чтобы сохранить внутренний баланс, организм активирует гуморальную систему, которая помогает справиться со стрессом. Основной задачей общего адаптационного синдрома является борьба организма со стрессом. Еще одним результатом анализа Селье является доказательство того, что стрессовые реакции имеют свои пределы. Когда организм часто подвергается стрессу, запасы энергии для борьбы со стрессорами уменьшаются, тем самым приводя организм к истощению.",
          Thecatabolicphase:"Катаболическая фаза",
          Thecatabolicphaseto:"начальная фаза, при которой учащается сердцебиение, повышается артериальное давление, увеличивается частота дыхания, расширяются зрачки, повышается мышечный тонус. Организм человека в этой фазе пользуется запасами гликогена в печени и мышцах, а затем переходит на запасы жиров для выработки энергии.",
          Theanabolicphase:"Анаболическая фаза",
          Theanabolicphaseto:"продление катаболической фазы, в этой фазе в организме человека восстанавливаются нарушенные структуры, поврежденные ткани и восполняются запасы энергии АТФ.",

          //* section 6
          Generalinformationaboutstressandtechniques:"Общая информация о стрессе и методиках.",
          Generalinformationbutton1:"Процессы в организме <br> во время стресса",
          Generalinformationbutton2:"Стресс как явление",
          Generalinformationbutton3:"Как мы <br> воспринимаем стресс",
          Generalinformationbutton4:"Методы борьбы со стрессом",
          Whathappensinthebodyduringstress:"Что происходит в организме во время стресса?",
          Whathappensinthebodyduringstressto:"Стресс — не просто чувство. Стресс — врожденная физическая реакция, которая проходит по всему телу. При длительном стрессе повреждаются многие органы и клетки во всем организме. Ответная реакция организма на стресс, физическая или психологическая, начинается в мозге, с активации нейроэндокринной системы. Часть нейроэндокринной системы, принимающая участие в выработке гормонов, называется гипоталамо-гипофизарно-надпочечниковая ось (ГГН-ось). ГГН-ось напрямую связана с гипофизом как центральным звеном передачи сигнала от мозга к эндокринной системе. Гипоталамус высвобождает кортикотропин-рилизинг гормон, активирует железу гипофиза на оси. Во время стресса нейроэндокринная система вырабатывает в кровь адренокортикотропный гормон (АКТГ). АКТГ стимулирует корки надпочечников высвобождать два гормона — норадреналин и эпинефрин. Эти симпатомиметические соединения, отвечающие за возбуждение органа к действию, инициируют симпатическую нервную систему, в результате чего возрастает сердечный ритм и кровоток. Следующий вырабатываемый гормон, кортизол, активирует системы в организме, предназначенные для поддержания стрессовых реакций, стимулируя высвобождение энергетических ресурсов за счет усиления глюконеогенеза и подавления нежизненно важных процессов, таких как активность иммунной системы. Когда уровень кортизола достигает определенной высоты, включается механизм отрицательной связи, воздействующий на гипоталамус и гипофиз. Такая реакция останавливает выход АКТГ и КРГ.А теперь подробнее исследуем психологические и эмоциональные аспекты стресса. Понятие об эмоциональном стрессе вводит Ричард Лазарус. По его мнению, эмоциональный стресс связан с активизацией познавательной деятельности, посредством которой человек определяет для себя степень угрозы и сопоставляет возникающие трудности с собственными возможностями их преодоления. Ввиду того, что состояние стресса сочетается со специфически дифференцированными эмоциями, под «эмоциональным стрессом» стали понимать широкий круг изменений психических проявлений, сопровождающихся выраженными неспецифическими изменениями биохимических, электрофизиологических и других коррелятов стресса. Стресс всегда связан с эмоциями, например страх, тревога, гнев. Эти эмоции специфические, то есть разные в разных ситуациях. Когда ученые говорят об эмоциональном стрессе, они имеют в виду не только сами эмоции, но и целый комплекс изменений в психике, как человек думает, чувствует, реагирует. Эти психические изменения всегда сопровождаются неспецифическими реакциями организма: выброс гормонов, таких как адреналин и кортизол, изменение электрической активности мозга, сердца, мышц, ускорение пульса, потливость, мышечное напряжение. Психологический стресс принадлежит к тем психологическим явлениям, которые называют психическими состояниями и под которыми понимают целостное своеобразие всех процессов, происходящих в психике человека в данный момент или за определенный отрезок времени. По мнению А.М. Столяренко, нельзя сводить психологический стресс только лишь к эмоциональной реакции. Эмоция — лишь одна из характеристик психической деятельности, носящей всегда целостный характер и включающей мотивационные, познавательные, волевые и психомоторные компоненты. Отсюда следует, что термины «эмоциональный стресс» и «психологический стресс» не совсем корректно отождествлять друг с другом, понимая, что психологический стресс — это системная психологическая реакция на ситуацию. Эмоциональный стресс делает акцент именно на эмоциях, таких как страх, злость, тревога. Психологический стресс — более широкий процесс, охватывающий всю психику: мысли, волю, мотивацию, эмоции и даже телесные реакции. Корреляция физиологических и психологических показателей стресса.",
          Stressisacomplexphenomenon:"Стресс — это комплексное явление",
          Stressisacomplexphenomenonto:"Включающее физиологические, поведенческие, субъективные и социально-психологические реакции. Изучение только отдельных аспектов приводит к утрате целостного понимания, поэтому сегодня акцент делается на их взаимосвязи. Исследования показывают, что психологические переживания напрямую связаны с физиологическими изменениями организма: уровень катехоламинов, адреналина и норадреналина, в крови коррелирует с эмоциями. Адреналин связан с тревогой и страхом, норадреналин — с решительностью или гневом. Стресс подавляет иммунную систему, повышая риск инфекций, аутоиммунных нарушений и опухолевого роста. Выделяемый при стрессе кортизол снижает защитные силы организма. Сильный и длительный стресс провоцирует патологии сердца, например через перекисное окисление липидов, нарушающее клетки сердечной мышцы. Утомление и монотонная деятельность отражаются на ЭЭГ — смещение к низким ритмам указывает на снижение активности мозга. Обобщая сказанное ранее, следует акцентировать внимание на наиболее важном различии: физиологический стресс вызывает реакции посредством нервных и гормональных механизмов, в то время как психологический не всегда приводит к ожидаемым реакциям. Реакция на психологическую угрозу может выражаться как в страхе, депрессии, различных по своему характеру висцеральных изменениях, так и в ухудшении показателей деятельности, моторных нарушениях и т. д. Физиологический стресс — реакция четкая и автоматическая. Психологический стресс — реакция индивидуальна и непредсказуема, может проявляться очень по-разному. Влияние стресса на эффективность деятельности, когнитивные и интегративные процессы. Зачастую патологические серьезные заболевания возникают в результате регулярных стрессов. Все патологии условно можно разбить на три группы: первая группа касается нарушений психического здоровья, которые затем реализуются в психосоматические нарушения; во второй группируются заболевания, сопровождающиеся различными морфофункциональными повреждениями, ухудшением состояния сердечно-сосудистой и нервной системы, проблемами со сном, неполадками в работе ЖКТ; к третьей относятся патологии, связанные с подавлением иммунной системы, включая рост опухолей и развитие инфекций, язвы желудка, анорексию, гипертонию и т.д.",
          Perceptionofstress:"Восприятие стресса",
          Perceptionofstressto:"Стресс — это не то, что с вами случилось, а то, как вы это воспринимаете. Если мы слишком часто «включаем» реакцию на стресс или не можем её выключить после события, она становится разрушительной. Одним из самых наглядных доказательств того, что многие серьезные заболевания возникают по причине чрезмерного стресса, является книга Роберта Сапольски «Почему у зебр не бывает инфаркта?». В книге приводится пример эксперимента, в котором зебры в момент реальной угрозы испытывают выброс адреналина и кортизола, после чего отдыхают. Пример из книги: «Зебра, спасаясь от льва, испытывает сильнейший стресс — учащается сердцебиение, повышается давление, кровь отливает от ЖКТ, приливает к мышцам. Но как только угроза исчезает — например, лев передумал и убежал — через несколько минут физиология зебры полностью возвращается к норме. Она снова спокойно пасётся на лугу, как ни в чём не бывало». Однако домашние животные, в связи с отсутствием выхода из напряженной ситуации «естественным путем», продолжают испытывать стресс. В книге отмечается, что у животных в дикой природе стрессовая реакция отключается гораздо быстрее, чем у животных не на свободе. В сравнении с людьми, которые начинают беспокоиться о проблеме, которой еще нет, животные, в данном случае зебры, реагируют на месте. Тем не менее, состояние во время стрессовых ситуаций у животных и у людей одинаковое: учащается сердцебиение, расширяются дыхательные пути, повышается уровень глюкозы в крови для выделения энергии АТФ. Еще одно различие заключается во времени: после выброса адреналина животное восстанавливается быстро, у человека же уровень гормонов остается повышенным длительное время. Р. Сапольски утверждает, что психологический стресс характерен только для людей. Люди способны испытывать очень сильные эмоции исключительно на основании своих собственных мыслей. Но эти сильные эмоции провоцируют соответствующие реакции в организме. Автор считает, что мы можем внешне ничего не делать, но в своей голове прокручивать различные негативные ситуации, то есть сами включать своими мыслями реакцию на стресс. Каждого человека в жизни посещали мысли: «А что будет если...» — завалю экзамен, не сдам вовремя отчет, не смогу заплатить за ипотеку, заболею смертельным заболеванием и т. д. Еще ничего страшного и катастрофического не случилось, а человек уже испытывает стресс. Мы сами индуцируем реакцию на стресс из страха перед возможным событием. Люди с «сильной» нервной системой чаще страдают от стресса при монотонных раздражителях, тогда как у «слабой» системы меньше ресурсов для долгого поддержания тонуса; межполушарная асимметрия может определять склонность к депрессии. Таким образом, стресс — это эволюционный механизм адаптации организма к окружающей среде. Он имеет свои стадии развития, классификацию, симптомы и причины появления. Психологи отмечают, что длительные переживания и тревога негативно влияют на психику человека, в связи с чем важно вовремя распознать стресс и грамотно управлять им, не давая возможности перерасти в хронический стресс.",
          Stressmanagementmethods:">Методы борьбы со стрессом",
          Stressmanagementmethodss:"Методы релаксации",
          Stressmanagementmethodsss:"Методы релаксации-это терапевтические упражнения, разработанные для помощи людям в снижении напряжения и тревожности.  Помимо психологического воздействия, стресс может вызывать физиологические реакции, такие как, учащенное сердцебиение, потливость, одышка и мышечное напряжение. Методы релаксации могут помочь уменьшить эти неприятные реакции.",
          Square:"Существует большое количество методик по борьбе со стрессом, одной из самых известных и простых является «дыхание по квадрату».",
          Squaree:"«дыхание по квадрату»",
          Squareee:"Данный метод может быть использованным пациентом в разным обстоятельствах, как до стрессовой ситуации, так и после, для эффективности этого метода не требуется спокойная обстановка. Суть метода заключается в том, что каждая фаза дыхательного цикла длится одинаковое количество времени, например по 2-4 секунды. Цель методики: активировать парасимпатическую нервную систему, которая отвечает за покой в организме человека.",
          Method:"При эмоциональных возбуждениях и тревожности специалисты советуют метод «5 4 3 2 1»",
          Methodd:"метод «5 4 3 2 1»",
          Methoddd:"Методика помогает отвлечь человека от тревожных мыслей и сосредоточить внимание на реальности с помощью пяти органов чувств: зрения, осязания, слуха, обоняния и вкуса. Сначала назовите вслух или про себя пять вещей, которые вы видите; для большей эффективности можете уточнить форму и цвет предметов. Затем прикоснитесь к четырем предметам, окружающим вас, чтобы переключиться на тактильные ощущения. Далее найдите три вещи, которые вы слышите, сосредоточив внимание на звуках, не пытаясь их усилить или заглушить. После этого назовите два запаха, которые чувствуете; если запахов нет, зафиксируйте их отсутствие. Обратите внимание на вещь, которую вы могли бы попробовать на вкус; необязательно что-то есть, достаточно просто представить вкус. Завершить методику можно десятью глубокими вдохами и выдохами. Указанные методики могут быть использованы только в случае тревожных расстройств или эмоциональной нестабильности, однако при сильной или частой тревоге методы вроде «дыхание по квадрату» или «5-4-3-2-1» могут оказаться недостаточными, и в таких случаях стоит обратиться к психотерапевту.",


          //! 2 page

          //* header
          burger1:"Анкетирование",
          burger2:"Заключение и рекомендации",
          burger3:"Диаграмма-1",
          burger4:"Диаграмма-2",
          burger5:"Диаграмма-3",

          //* section 1
          class:"(5 - 7 - 10 классы)",
          classs:"Анкетирование среди учащихся",
          buutton:"результаты",
          buuttonn:"5-ые классы",
          buuttonnn:"7-ые классы",
          buuttonnnn:"10-ые классы",
          Thegeneralcourseoftheinvestigation:"Общий ход иследования",
          Thegeneralcourseoftheinvestigationto:"В 2025 учебном году нами было проведено исследование, направленное на изучение уровня стресса у учащихся разных возрастных категорий. Целью нашего исследования стало установление факторов, влияющих на развитие стрессовых реакций у учащихся. В ходе наблюдений и анализа мы заметили, что возраст напрямую влияет на проявление стресса. Процесс перехода из одного звена в другое повышает уровень тревожности и эмоционального напряжения у школьников. С переходом в среднее звено у учащихся меняется социум. Ребенок сталкивается с рядом изменений в социальной среде: смена учителей, появление новых предметов, кабинетная система. Изменяется форма общения с учителями: они становятся строже и требовательнее, отсутствует эмоциональная связь, как с классным руководителем в начальном звене. Среднее звено считается переходным периодом, так как оно лежит между «детством» и «подростковым возрастом». В этом возрасте происходят гормональные сдвиги, начинается половое созревание. Наблюдаются изменения в учебной сфере, которые непосредственно влияют на организм учащегося: с появлением новых предметов увеличивается их количество. Старшее звено определяется экзаменационной нагрузкой и углублением учебного процесса. Повышается ответственность за свое будущее. Перед учащимся стоит выбор, определяющий дальнейшую взрослую жизнь. Для того чтобы определить, какие возрастные группы подвергаются стрессу чаще всего, мы провели исследования среди учащихся разных классов. Результаты помогли проследить возрастную динамику проявления стресса, определить факторы, способствующие его появлению, и выявить пути профилактики стрессовых состояний среди учащихся. Мы провели анкетирование «Анализ стрессовых ситуаций» с целью изучения и анализа физиологических и психологических аспектов стресса, влияющих на состояние школьников.",
          fivethgraderesults:"Результаты 5-ых классов",
          fivethgraderesultsto:"Смотрите диаграмму 1",
          fivethgraderesultstoo:"Результаты анкетирования показали, что среди учащихся пятых классов на вопрос «Как часто вы волнуетесь?» большая часть учеников (54%) выбрали вариант «иногда», 19% — «часто», 21% — «редко» и только 6% — «никогда». По результатам можно сделать вывод, что пятиклассники регулярно испытывают стресс, но его уровень не достигает постоянного эмоционального напряжения. Чаще всего причиной стресса являлись учеба и оценивание: тесты и контрольные работы — 29%, плохие оценки — 29%. Результаты свидетельствуют о том, что главными факторами, вызывающими стресс у школьников, являются страх ошибки и социальное давление. Одной из самых распространенных реакций на стрессовую ситуацию является учащенное сердцебиение (30%) и страх (21%). Менее распространенными реакциями являются злость (8%), желание плакать (13%), боль в животе и головная боль (9%), дрожь в теле выбрали 3% учащихся. В силу возраста пятиклассники не всегда понимают, что с ними происходит. Детям сложно связывать физические ощущения с эмоциональными состояниями, вследствие чего 16% учащихся выбрали вариант «ничего не чувствую», а большинство испытывают страх. Большинство учеников, а именно 79%, признались, что во время стресса ничего не делают и замыкаются в себе. Реже встречается вариант «плачу» (17%), и всего 4% обращаются за помощью к родителям или учителям, что говорит о том, что школьники начального звена боятся попросить помощь взрослых. На вопрос «что помогает восстановиться?» большинство детей, 55%, ответили, что общение с близкими помогает справиться со стрессом. Из этого можно сделать вывод, что большинство детей не понимают, что с ними происходит, и редко обращаются за помощью, предпочитая замкнуться в себе, что подчеркивает важность обучения детей навыкам справляться со стрессом. При этом общение с близкими помогает большинству восстанавливаться, что указывает на потребность детей в эмоциональной поддержке и внимании родителей.",
          seventhgraderesults:"Результаты 7-ых классов",
          seventhgraderesultsto:"Смотрите диаграмму 2",
          seventhgraderesultstoo:"На вопрос, как часто учащиеся испытывают стресс, большинство семиклассников (46%) выбрали вариант «часто». Еще 18% ответили «иногда» и «редко», а 19% — «почти никогда». Исходя из этих данных, можно сделать вывод, что в отличие от начального звена стресс у среднего звена носит более регулярный характер. Так же, как и в младших классах, частыми стрессорами являются контрольные работы (35%) и плохие оценки (35%). Реже встречаются стрессовые ситуации, связанные с ответом у доски (23%) и общением с одноклассниками (6%). Таким образом, стресс у семиклассников главным образом связан с учебной нагрузкой. Наиболее распространенной реакцией на стрессовые ситуации является учащенное сердцебиение (28%). Также часто встречаются грусть и замкнутость (22%). Реже всего выбирают головную боль и боль в животе (12%), злость (9%) и ощущение нехватки воздуха (8%). Высокий процент тех, кто «ничего не чувствует», свидетельствует об эмоциональной незрелости. На вопрос о том, как школьники справляются со стрессом, одним из самых распространенных ответов является «справляюсь сам» (43%), а четверть учеников (26%) не боятся говорить о своем состоянии и делятся с взрослыми. 18% испытывают грусть и плачут, а оставшиеся 13% выбирают другой вариант, что указывает на то, что ученики среднего звена в основном справляются со стрессом самостоятельно, но при этом осознают важность помощи взрослых. Социальная поддержка и хобби помогают справиться со стрессом, но особо важными являются коммуникация (23%) и активный отдых. Также отмечается, что семиклассники используют онлайн-игры (17%) для снижения уровня стресса.",
          tenthgraderesults:"Результаты 10-ых классов",
          tenthgraderesultsto:"Смотрите диаграмму 3",
          tenthgraderesultstoo:"Больше половины учащихся десятых классов сталкиваются со стрессом часто и иногда (31%). Еще 21% выбрали вариант «редко», и только 17% отметили, что никогда не сталкиваются со стрессом, что показывает, что каждый третий ученик испытывает стресс регулярно. Основными причинами стресса у старшеклассников являются контрольные и проверочные работы (51%), ответы на уроке (21%), реже — плохие оценки (15%) и трудности общения с одноклассниками (13%). Наиболее типичными реакциями являются учащенное сердцебиение (27%), грусть и отстраненность (20%), агрессия (18%), а трудности с дыханием (17%) и отсутствие симптомов (18%) встречаются реже. Большая часть учащихся (38%) предпочитают отстраняться и проводить время в одиночестве, 28% делятся с друзьями и только 6% обращаются ко взрослым. Общение (25%) является основным способом снижения стресса, второстепенными методами являются музыка и игры (14%), еда и спорт (12%). Старшеклассники также обращаются к психологу (2%) и практикуют дыхательные упражнения (7%). Проведенное анкетирование показало, что стресс является неотъемлемой частью жизни школьников всех возрастов, но его проявления и реакции различаются в зависимости от возраста. Старшеклассники чаще всего подвергаются стрессу из-за повышенной ответственности и учебной нагрузки, при этом их ответы демонстрируют большую эмоциональную зрелость, включая обращение к психологу, прием успокоительных и дыхательные практики. Для младшего и среднего звена основными причинами стресса остаются контрольные работы и оценки, а физиологическим проявлением чаще всего становится учащенное сердцебиение. Младшие школьники испытывают страх и непонимание своего состояния и реже обращаются за помощью к взрослым, однако общение с близкими (55%) является для них наиболее эффективным способом восстановления. Семиклассники чаще справляются со стрессом самостоятельно или уходят в себя, что отражает переходный возраст и стремление к самостоятельности. Общим для всех возрастных групп остается то, что стресс связан с учебой и сопровождается физическими и психологическими проявлениями. Таким образом, школьникам необходима эмоциональная поддержка, обучение навыкам стрессоустойчивости и создание доверительной атмосферы в школе и семье.",

          //* 2 section
          Conclusion:"Заключение",
          Coonclusion:"На основе изученной литературы и анализа анкетирования учащихся 5, 7 и 10 классов было установлено, что стресс является неотъемлемой частью жизни школьников всех возрастов. Однако его частота, причины и способы преодоления различаются в зависимости от возраста. Результаты анкетирования подтвердили нашу гипотезу: наибольший уровень стресса наблюдается у школьников старшего звена, что связано с повышенной учебной нагрузкой из-за экзаменов и ответственностью за выбор будущей карьеры. Тем не менее, со стрессовыми ситуациями сталкиваются учащиеся всех возрастов, поэтому важно формировать у школьников навыки стрессоустойчивости, поддерживать благоприятную атмосферу в школе и семье, а также повышать уровень осведомленности о влиянии стресса на организм человека. Исходя из этого, результатом нашей работы стала разработка сайта, способствующего повышению осведомленности о влиянии стрессов на организм человека, а также предоставляющего методики для развития стрессоустойчивости. Таким образом, наше исследование имеет не только теоретическую, но и практическую значимость. Стресс оказывает комплексное влияние на организм человека, проявляясь как на физиологическом, так и психологическом уровне, поэтому важно вовремя распознать стресс и грамотно управлять им, не давая возможности перерасти в хронический.",
          Conclusionn:"И рекомендации",
          Conclusionnn:"Заключение",
          Conclusionnnn:"Учащимся",
          Conclusionnnnn:"Родителям",
          Conclusionnnnnn:"Учителям",
          Recommendationsforstudents:"Рекомендации учащимся",
          Recommendationsforstudentsto:"Быть бдительным к своему здоровью, не игнорировать тревожность и раздражительность, научиться пользоваться временем, чередовать учебу и отдых, не перегружать себя, оставлять время на прогулки, сон и хобби, делиться мыслями с друзьями и близкими, так как поддержка является важной частью преодоления стресса, уделять время себе — сон, движение и питание являются базой для устойчивости к стрессу, учитывая, что недосып влияет на здоровье больше, чем перегрузка учебой, не бояться просить помощи у преподавателей, так как обращение за поддержкой — это не слабость, а зрелый шаг.",
          Recommendationsforparenst:"Рекомендации родителям",
          Recommendationsforparenstto:"Учитывать возрастные особенности подростка в условиях стресса, помогать справляться с внутренними конфликтами, даже если они кажутся «мелочью», создавать дома атмосферу эмоциональной безопасности, чтобы ребенок не боялся делиться переживаниями, развивать у подростка навыки саморегуляции и рефлексии, помогать анализировать свою реакцию на стресс, быть внимательным к здоровью ребенка и при хронической усталости или тревожности обращаться к специалисту, быть эмоционально вовлеченным в жизнь ребенка и проводить больше времени совместно.",
          Recommendationsforteacher:"Рекомендации учителям предметника",
          Recommendationsforteacherto:"Относиться с пониманием к ученикам, проявляющим раздражительность и тревожность, так как это может быть признаком стресса, а не плохого поведения, поддерживать учеников, создавая уютную психологическую атмосферу, избегать чрезмерной информационной нагрузки, учитывать потенциал каждого учащегося, поддерживать учеников за старания, а не только за успех, признавать их усилия и принимать ошибки, что помогает справляться со страхом и способствует устойчивости к стрессу, держать баланс между поддержкой и требовательностью, чтобы ученик понимал, что всегда может обратиться за помощью к учителю.",


          //* section 3
          Diagramone:"Диаграмма 1",
          D:"5 класс",
          Dd:"1. Как часто ты волнуешься?",
          Ddd:"2. Когда ты волнуешься больше всего?",
          Dddd:"3. Что ты чувствуешь, когда волнуешься?",
          Ddddd:"4. Что ты делаешь, когда волнуешься?",
          Dddddd:"5. Что помогает тебе снова стать весёлым?",

          //* section 4
          Diagramon:"Диаграмма 2",
          T:"7 класс",
          Tt:"1. Ты часто волнуешься?",
          Ttt:"2. В какие моменты чаще всего испытываешь стресс?",
          Tttt:"3. Что ты испытываешь, когда переживаешь?",
          Ttttt:"4. Как ты справляешься со стрессом?",
          Tttttt:"5. Что помогает успокоиться после стресса?",

          //* section 5
          Diagramo:"Диаграмма 3",
          M:"10 класс",
          Mm:"1. Как часто испытываете стресс?",
          Mmm:"2. Какие ситуации чаще всего вызывают стресс?",
          Mmmm:"3. Что чувствуешь, когда переживаешь?",
          Mmmmm:"4. Какие меры предпринимаешь в стрессовой ситуации?",
          Mmmmmm:"5. Что помогает справляться со стрессом?",


        },
      
        kk: {
          //* header
          theory: "«Теория»",
          practice: "«Тәжірибе»",
          classification: "Стрестің жіктелуі",
          forms: "Стрестің түрлері",
          types: "Стрессорлардың түрлері",
          stages: "Стресске бейімделу сатылары",
          phases: "Стресс фазалары",
          info: "Стресс және әдістемелер туралы жалпы ақпарат",
          stressors: "Стресс факторларының түрлері",
          adaptation: "Стресске бейімделу кезеңдері",
      
          //* section 1
          influence: "СТРЕССТІҢ АДАМ АҒЗАСЫНА ӘСЕРІ",
          aboutstress: "Стресс дегеніміз не",
          aboutstressinfo:"Стресс (шиеленіс) деп организмнің әртүрлі қолайсыз факторлардың (физикалық немесе психологиялық) әсеріне спецификалық емес бейімделу реакцияларының жиынтығы түсініледі. Адам ағзасындағы барлық процестер психоэмоционалды жағдайға жауап береді. Адам ағзасындағы стресстің пайда болуы гомеостаз, жүйке жүйесінің күйі және т. б.",
          hans:"ГАНС СЕЛЬЕНІҢ ЗЕРТТЕУЛЕРІ",
          selye:"Ганс Сельенің бақылауларының арқасында биологиялық стресс теориясы термині пайда болды. Ганс Сельенің жалпы бейімделу синдромының моделі дененің стрессорға қалай жауап беретінін және стресске қалай бейімделетінін түсіндіреді. Селье өзінің зерттеулерінде биологиялық тұрғыдан алғанда, дене гомеостазды қалпына келтіру және сақтау үшін сыртқы стресстерге бейімделетінін атап өтті. Ішкі тепе-теңдікті сақтау үшін дене стрессті жеңуге көмектесетін гуморальдық жүйені белсендіреді. Жалпы бейімделу синдромының негізгі міндеті-ағзаның стресспен күресу. Селье талдауының тағы бір нәтижесі-стресстік реакциялардың шегі бар екендігінің дәлелі. Дене жиі күйзеліске ұшыраған кезде, стресстермен күресу үшін энергия қоры азаяды, осылайша денені сарқылуға әкеледі.",
          classificationofstress: "Стресстің жіктелуі",
          everydaystress: "Күнделікті стресс",
          everydaystressto:"дененің күнделікті өмірдегі ұсақ оқиғаларға реакциясы",
          emotionalstress: "Эмоционалды стресс",
          emotionalstressto:"жүйке жүйесінің шамадан тыс жүктелуіне жауап",
          occupationalstress:"Кәсіби стресс",
          occupationalstressto: "еңбек қызметіндегі шиеленісті жағдайларға психологиялық немесе физикалық реакцияларда көрінетін алуан түрлі құбылыс",
          informationstress: "Ақпараттық стресс",
          informationstressto: "ақпараттық жүктемелер нәтижесінде пайда болатын жағдай",

          //* section2
          formsofstress:"Стресс формалары",
          formsofstressto:"Медицинада, физиологияда, психологияда стресстің оң (эстресс) және теріс (күйзеліс) формалары ажыратылады",
          Eustress:"Эустресс",
          Eustressto:"пайдалы стресс. Стресс дененің жұмысын сергітетін болса және қорғаныс күштерін жұмылдыруға ықпал етсе пайдалы болуы мүмкін мысалдар емтихан немесе белгілі бір шиеленіске қарамастан, түпкілікті нәтижеден ләззат пен қуаныш әкелетін спектакль сияқты маңызды оқиғаға дайындықты қамтиды. Эустресс әдетте қысқа мерзімді және стресс аяқталғаннан кейін жоғалады, оң нәтиже береді",
          Distress:"Қиындық",
          Distressto:"адам ағзасы жеңе алмайтын стресстің зиянды, жағымсыз түрі. Бұл адамның моральдық денсаулығын бұзады және тіпті ауыр психикалық ауруларға әкелуі мүмкін. Бұл түр қауіп ретінде қабылданатын және физикалық және психикалық денсаулыққа теріс әсер ететін жағдайлармен байланысты. Мысалдарға жұмыстағы созылмалы проблемалар, жеке қатынастардағы қақтығыстар, қаржылық қиындықтар немесе ауыр аурулар жатады. Күнделікті сөйлеуде адам күйзеліске ұшырайды деп айтылғанда, олар әдетте шамадан тыс стрессті немесе күйзелісті білдіреді. Сонымен қатар, стресс-бұл стресстің реакциясы (стрессті тудыратын әсерлер,) кез-келген тітіркендіргішке емес, төтенше тітіркендіргіш.",
          
          //* section 3
          Typesofstressors:"Стресс факторларының түрлері",
          Typesofstressorsto:"Физиологиялық және психологиялық стресстерді ажыратыңыз",
          Physiologicalstressors:"Физиологиялық стресстер",
          Physiologicalstressorsto:"дене тіндеріне тікелей әсер етеді. Оларға ауырсыну, суық, жоғары температура, шамадан тыс физикалық белсенділік және т. б.",
          Biological:"Биологиялық (физиологиялық стресс)",
          Biologicalto:"ол гомеостаздың бұзылуымен сипатталады және денеге қолайсыз ынталандырудың тікелей әсерінен туындайды. Оларды тудыратын факторлардың ішінде аштық, гипотермия, шөлдеу, қан айналымының бұзылуы, тыныс алу, жүйке жүйесінің қызметі және т. б.",
          Psychologicalstressors:"Психологиялық стресстер",
          Psychologicalstressorsto:"бұл оқиғалардың биологиялық немесе әлеуметтік маңыздылығын көрсететін ынталандырулар. Бұл қауіптің, қауіптің, тәжірибенің, реніштің сигналдары, күрделі мәселені шешу қажеттілігі.",
          Psychologicalstress:"Психологиялық стресс",
          Psychologicalstressto:"адамның жеке тұлға мен қоршаған әлем арасындағы жұмыстардың өзара әрекеттесу ерекшеліктеріне реакциясы (Р. Лазарус, Р. Ланьер бойынша). Психологиялық стресс сигналдық тітіркендіргіштерден туындайды. Ол қауіп, реніш және т.б. жағдайында, сондай-ақ жануар мен адам ұзақ уақыт бойы өзінің биологиялық немесе әлеуметтік қажеттіліктерін қанағаттандыра алмайтын жанжалды жағдайлар жағдайында пайда болады.",

          //* section 4
          Observations:"Ганс Сельенің Бақылаулары",
          Observationsto:"Және стресске бейімделу кезеңдері.",
          Observationstoo:"Ганс Сельенің бақылауларының арқасында биологиялық стресс теориясы термині пайда болды. Ганс Сельенің жалпы бейімделу синдромының моделі дененің стрессорға қалай жауап беретінін және стресске қалай бейімделетінін түсіндіреді. Селье өзінің зерттеулерінде биологиялық тұрғыдан алғанда, дене гомеостазды қалпына келтіру және сақтау үшін сыртқы стресстерге бейімделетінін атап өтті. Биологиялық бейімделуде, яғни стресске бейімделуде үш кезеңді ажыратуға болады.",
          Stageone:"Бірінші кезең",
          Stageonee:"Мазасыздық кезеңі",
          Stageoneee:"Бұл кезеңде дене белгілі бір ерекше емес факторға тап болады және оған бейімделуге тырысады. Қауіп режимі қосылады: тым суық, тым қорқынышты, ауыр, қауіпті және т.б. содан кейін дене жұмылдырылады, өзін-өзі реттеу механизмдері қосылады. Егер қорғаныс реакциялары тиімді болса және стресстің әсері төмендесе немесе тоқтаса, онда дене қалыпты жағдайға оралады, мазасыздық басылады. Көптеген стресстер осы кезеңде шешіледі.",
          Stagetwo:"Екінші кезең",
          Stagetwoo:"Бейімделу кезеңі.",
          Stagetwooo:"Жаңа жағдайларға бейімделу бар. Бұл кезең стресстің ұзақ уақыт әсер етуімен, дененің қорғаныс реакцияларын сақтау қажеттілігі туындаған кезде пайда болады. Бейімделу резервтерін теңгерімді жұмсау бар. Бұл кезеңде адам жағдайдан шығудың оңтайлы жолдарын талдауға және іздеуге қабілетті.",
          Stagethree:"Үшінші кезең",
          Stagethreee:"Сарқылу кезеңі.",
          Stagethreeee:"Егер стресс ұзақ уақыт жұмыс істесе, гормоналды ресурстардың сарқылуы және бейімделу жүйелерінің бұзылуы орын алады. Дененің төзімділігі айтарлықтай төмендейді. Бұл кезеңде стресстен туындаған аурулар пайда болады.",

          //* section 5
          Stressphases:"Стресс фазалары (анаболикалық және катаболикалық)",
          Stressphasesto:"Катаболикалық және анаболикалық фазалар организмнің стресстік жағдайға жауап ретінде қоздыратын метаболикалық процестерін білдіреді. Катаболикалық фаза анаболикалық тотықсыздану кезінде бұзылумен сипатталады.",
          Stressphasestoo:"Ішкі тепе-теңдікті сақтау үшін дене стрессті жеңуге көмектесетін гуморальдық жүйені белсендіреді. Жалпы бейімделу синдромының негізгі міндеті-ағзаның стресспен күресу. Селье талдауының тағы бір нәтижесі-стресстік реакциялардың шегі бар екендігінің дәлелі. Дене жиі күйзеліске ұшыраған кезде, стресстермен күресу үшін энергия қоры азаяды, осылайша денені сарқылуға әкеледі.",
          Thecatabolicphase:"Катаболикалық фаза",
          Thecatabolicphaseto:"бастапқы кезең, онда жүрек соғысы жиілейді, қан қысымы көтеріледі, тыныс алу жиілігі жоғарылайды, оқушылар кеңейеді, бұлшықет тонусы жоғарылайды. Бұл фазадағы адам ағзасы бауыр мен бұлшықеттердегі гликоген қорларын пайдаланады, содан кейін энергия өндіру үшін май қорларына ауысады.",
          Theanabolicphase:"Анаболикалық фаза",
          Theanabolicphaseto:"катаболикалық фазаның ұзаруы, бұл фазада адам ағзасында бұзылған құрылымдар, зақымдалған тіндер қалпына келтіріліп, АТФ энергия қорлары толықтырылады.",

          //* section 6
          Generalinformationaboutstressandtechniques:"Стресс және техника туралы жалпы ақпарат.",
          Generalinformationbutton1:"Стресс кезінде ағзадағы процестер",
          Generalinformationbutton2:"Стресс құбылыс ретінде",
          Generalinformationbutton3:"Біз <br> стрессті қалай қабылдаймыз",
          Generalinformationbutton4:"Стресспен күресу әдістері",
          Whathappensinthebodyduringstress:"Стресс кезінде денеде не болады?",
          Whathappensinthebodyduringstressto:"Стресс тек сезім емес. Стресс-бұл бүкіл денеде жүретін туа біткен физикалық реакция. Ұзақ мерзімді стрессте бүкіл ағзадағы көптеген органдар мен жасушалар зақымдалады. Дененің стресске реакциясы, физикалық немесе психологиялық, мида нейроэндокриндік жүйені белсендіруден басталады. Гормондарды өндіруге қатысатын нейроэндокриндік жүйенің бөлігі деп аталады гипоталамус-гипофиз-бүйрек үсті осі (HGN осі). GGN осі мидан эндокриндік жүйеге сигнал берудің орталық буыны ретінде гипофизмен тікелей байланысты. Гипоталамус кортикотропинді босататын гормон шығарады, осьтегі гипофиз безін белсендіреді. Стресс кезінде нейроэндокриндік жүйе қанға адренокортикотропты гормон (ACTH) шығарады. ACTH бүйрек үсті безінің қыртысын екі гормонды — норадреналин мен эпинефринді шығаруға ынталандырады. Органның әрекетке қозуына жауап беретін бұл симпатомиметикалық қосылыстар симпатикалық жүйке жүйесін бастайды, нәтижесінде жүрекмағы жоғарылайды",
          Stressisacomplexphenomenon:"Стресс-бұл күрделі құбылыс",
          Stressisacomplexphenomenonto:"Физиологиялық, мінез-құлық, субъективті және әлеуметтік-психологиялық реакцияларды қамтиды. Тек жекелеген аспектілерді зерттеу біртұтас түсініктің жоғалуына әкеледі, сондықтан бүгінде олардың өзара байланысына баса назар аударылады. Зерттеулер көрсеткендей, психологиялық тәжірибелер дененің физиологиялық өзгерістерімен тікелей байланысты: қандағы катехоламиндер, адреналин және норадреналин деңгейі эмоциялармен байланысты. Адреналин мазасыздық пен қорқынышпен, норадреналин шешімділікпен немесе ашумен байланысты. Стресс иммундық жүйені басады, инфекциялар, аутоиммундық бұзылулар және ісік өсу қаупін арттырады. Стресс кезінде бөлінетін кортизол дененің қорғанысын төмендетеді. Күшті және ұзаққа созылған стресс жүрек патологиясын тудырады, мысалы, жүрек бұлшықетінің жасушаларын бұзатын липидтердің асқын тотығуы арқылы. Шаршау және монотонды белсенділік ЭЭГ — ге әсер етеді-төмен ритақтарға ауысу ми белсенділігінің төмендеуін көрсетеді. Жоғарыда айтылғандарды қорытындылай келе, ең маңыздысына назар аудару керек",
          Perceptionofstress:"Стрессті қабылдау",
          Perceptionofstressto:"Стресс-бұл сізге болған нәрсе емес, оны қалай қабылдағаныңыз. Егер біз стресстің реакциясын жиі қоссақ немесе оқиғадан кейін оны өшіре алмасақ, ол жойқын болады. Көптеген ауыр аурулардың шамадан тыс стресстен туындайтынының ең айқын дәлелдерінің бірі-Роберт Сапольскийдің  неліктен зебраларда инфаркт болмайды?». Кітапта зебралар нақты қауіп төнген кезде адреналин мен кортизолдың бөлінуін бастан кешіретін эксперименттің мысалы келтірілген, содан кейін олар демалады. Кітаптан мысал: Зебра арыстаннан қашып, қатты күйзеліске ұшырайды-жүрек соғысы тездейді, қысым жоғарылайды, асқазан-ішек жолынан қан құйылады, бұлшықетке толады. Бірақ қауіп жойылғаннан кейін — мысалы, Арыстан өз ойын өзгертіп, қашып кетті-бірнеше минуттан кейін зебра физиологиясы толығымен қалпына келеді. Ол тағы да ешнәрсе болмағандай шабындықта жайбарақат жайылып жүр. Алайда, үй жануарлары шиеленісті жағдайдан табиғи жолмен шығудың болмауына байланысты",
          Stressmanagementmethods:">Стресспен күресу әдістері",
          Stressmanagementmethodss:"Релаксация әдістері",
          Stressmanagementmethodsss:"Релаксация әдістері-бұл адамдарға шиеленіс пен мазасыздықты азайтуға көмектесетін терапевтік жаттығулар. Психологиялық әсерден басқа, стресс физиологиялық реакцияларды тудыруы мүмкін, мысалы, жүрек соғуы, тершеңдік, ентігу және бұлшықет кернеуі. Релаксация әдістері бұл жағымсыз реакцияларды азайтуға көмектеседі.",
          Square:"Стресспен күресудің көптеген әдістері бар, ең танымал және қарапайымдарының бірі - төртбұрышты тыныс алу.",
          Squaree:"квадрат бойынша тыныс алу",
          Squareee:"Бұл әдісті пациент әртүрлі жағдайларда, стресстік жағдайға дейін де, одан кейін де қолдана алады, бұл әдістің тиімділігі үшін тыныш орта қажет емес. Әдістің мәні-тыныс алу циклінің әр фазасы бірдей уақытқа созылады, мысалы, 2-4 секунд. Әдістеменің мақсаты: адам ағзасындағы тыныштыққа жауап беретін парасимпатикалық жүйке жүйесін белсендіру.",
          Method:"Эмоционалды қозу мен мазасыздық кезінде мамандар 5 4 3 2 1 әдісін ұсынады",
          Methodd:"5 4 3 2 1 әдісі",
          Methoddd:"Методика помогает отвлечь человека от тревожных мыслей и сосредоточить внимание на реальности с помощью пяти органов чувств: зрения, осязания, слуха, обоняния и вкуса. Сначала назовите вслух или про себя пять вещей, которые вы видите; для большей эффективности можете уточнить форму и цвет предметов. Затем прикоснитесь к четырем предметам, окружающим вас, чтобы переключиться на тактильные ощущения. Далее найдите три вещи, которые вы слышите, сосредоточив внимание на звуках, не пытаясь их усилить или заглушить. После этого назовите два запаха, которые чувствуете; если запахов нет, зафиксируйте их отсутствие. Обратите внимание на вещь, которую вы могли бы попробовать на вкус; необязательно что-то есть, достаточно просто представить вкус. Завершить методику можно десятью глубокими вдохами и выдохами. Указанные методики могут быть использованы только в случае тревожных расстройств или эмоциональной нестабильности, однако при сильной или частой тревоге методы вроде «дыхание по квадрату» или «5-4-3-2-1» могут оказаться недостаточными, и в таких случаях стоит обратиться к психотерапевту.",

          //! 2 page

          //* header
          burger1:"Сауалнама",
          burger2:"Қорытынды және ұсыныстар",
          burger3:"Диаграмма-1",
          burger4:"Диаграмма-2",
          burger5:"Диаграмма-3",

          //* section 1
          class:"(5 - 7 - 10 сыныптар)",
          classs:"Оқушылар арасында сауалнама жүргізу",
          buutton:"нәтижелер",
          buuttonn:"5 сыныптар",
          buuttonnn:"7 сыныптар",
          buuttonnnn:"10 сыныптар",
          Thegeneralcourseoftheinvestigation:"Зерттеудің жалпы барысы",
          Thegeneralcourseoftheinvestigationto:"2025 оқу жылында біз әртүрлі жас санаттарындағы оқушылардың стресс деңгейін зерттеуге бағытталған зерттеу жүргіздік. Біздің зерттеуіміздің мақсаты оқушылардың стресстік реакцияларының дамуына әсер ететін факторларды анықтау болды. Бақылау және талдау барысында біз жас стресстің көрінісіне тікелей әсер ететінін байқадық. Бір буыннан екінші буынға ауысу процесі мектеп оқушыларында мазасыздық пен эмоционалдық шиеленіс деңгейін арттырады. Оқушылардың орта буынға ауысуымен қоғам өзгереді. Бала әлеуметтік ортада бірқатар өзгерістерге тап болады: мұғалімдердің ауысуы, жаңа пәндердің пайда болуы, кабинет жүйесі. Мұғалімдермен қарым-қатынас формасы өзгереді: олар қатал және талапшыл болады, бастапқы буындағы сынып жетекшісі сияқты эмоционалды байланыс жоқ. Орта буын өтпелі кезең болып саналады, өйткені ол балалық шақ пен жасөспірім арасында жатыр. Бұл жаста гормоналды өзгерістер орын алады, жыныстық жетілу басталады. Оқу бағдарламасында өзгерістер байқалуда",
          fivethgraderesults:"5 сынып нәтижелері",
          fivethgraderesultsto:"1-диаграмманы қараңыз",
          fivethgraderesultstoo:"Сауалнама нәтижелері бесінші сынып оқушылары арасында сіз қаншалықты жиі алаңдайсыз?оқушылардың көпшілігі (54%) кейде, 19% жиі, 21% сирек  және тек 6%  ешқашан опциясын таңдады. Нәтижелер бойынша бесінші сынып оқушылары үнемі күйзеліске ұшырайды, бірақ оның деңгейі тұрақты эмоционалды шиеленіске жетпейді деген қорытынды жасауға болады. Көбінесе стресстің себебі оқу және бағалау болды: тесттер мен тесттер — 29%, нашар бағалар — 29%. Нәтижелер мектеп оқушыларында стрессті тудыратын негізгі факторлар қателік қорқынышы мен әлеуметтік қысым екенін көрсетеді. Стресстік жағдайға ең көп таралған реакциялардың бірі-жүрек соғуы (30%) және қорқыныш (21%). Аз кездесетін реакциялар-ашулану (8%), жылауға деген ұмтылыс (13%), іштің ауыруы және бас ауруы (9%), дененің дірілдеуін оқушылардың 3% таңдады. Жасына байланысты бесінші сынып оқушылары олармен не болып жатқанын әрдайым түсіне бермейді. Балаларға физикалық сезімдерді эмоциялармен байланыстыру қиын.",
          seventhgraderesults:"7 сынып нәтижелері",
          seventhgraderesultsto:"2-диаграмманы қараңыз",
          seventhgraderesultstoo:"Оқушылардың қаншалықты жиі күйзеліске ұшырайтынын сұрағанда, жетінші сынып оқушыларының көпшілігі (46%) жиі опциясын таңдады. Тағы 18% — ы кейде және сирек деп жауап берді, ал 19% - ы ешқашан дерлік деп жауап берді. Осы мәліметтерге сүйене отырып, бастапқы буыннан айырмашылығы, орта буындағы стресс тұрақты болады деген қорытынды жасауға болады. Төменгі сыныптардағыдай, жиі стресстер-бақылау жұмыстары (35%) және нашар бағалар (35%). Тақтада жауап беруге (23%) және сыныптастарымен қарым-қатынасқа (6%) байланысты стресстік жағдайлар сирек кездеседі. Осылайша, жетінші сынып оқушыларындағы стресс негізінен оқу жүктемесімен байланысты. Стресстік жағдайларға ең көп таралған реакция-жүрек соғу жиілігінің жоғарылауы (28%). Сондай-ақ, қайғы мен оқшаулану жиі кездеседі (22%). Көбінесе бас ауруы мен іштің ауыруы (12%), ашулану (9%) және ауа жетіспеушілік сезімі (8%) таңдалады. Ештеңе сезбейтіндердің жоғары пайызы эмоционалды жетілмегендікті көрсетеді. Оқушылар стрессті қалай жеңеді деген сұраққа",
          tenthgraderesults:"10 сынып нәтижелері",
          tenthgraderesultsto:"3-диаграмманы қараңыз",
          tenthgraderesultstoo:"Оныншы сынып оқушыларының жартысынан көбі жиі және кейде стресске ұшырайды (31%). Тағы 21% сирек опциясын таңдады және тек 17% - ы ешқашан стресске ұшырамайтынын атап өтті, бұл әрбір үшінші оқушының үнемі күйзеліске ұшырайтынын көрсетеді. Жоғары сынып оқушыларындағы стресстің негізгі себептері-бақылау және тексеру жұмыстары (51%), сабақтағы жауаптар (21%), нашар бағалар (15%) және сыныптастарымен қарым — қатынас қиындықтары (13%). Ең типтік реакциялар-жүрек соғу жиілігінің жоғарылауы (27%), қайғы мен отряд (20%), агрессия (18%), тыныс алудың қиындауы (17%) және симптомдардың болмауы (18%) сирек кездеседі. Оқушылардың көп бөлігі (38%) алыстап, жалғыз уақыт өткізуді жөн көреді, 28% достарымен бөліседі және тек 6% ересектерге жүгінеді. Қарым-қатынас (25%) стрессті төмендетудің негізгі әдісі болып табылады, екінші әдістер-музыка мен ойын (14%), тамақ және спорт (12%). Орта мектеп оқушылары сонымен қатар психологқа жүгінеді (2%) және тыныс алу жаттығуларымен айналысады.",

          //* 2 section
          Conclusion:"Қорытынды",
          Coonclusion:"Зерттелген әдебиеттер мен 5, 7 және 10 сынып оқушыларының сауалнамаларын талдау негізінде стресс барлық жастағы мектеп оқушыларының өмірінің ажырамас бөлігі екендігі анықталды. Дегенмен, оның жиілігі, себептері және күресу жолдары жасына байланысты өзгереді. Сауалнама нәтижелері біздің гипотезамызды растады: стресстің ең жоғары деңгейі жоғары сынып оқушыларында байқалады, бұл емтихандарға байланысты оқу жүктемесінің жоғарылауымен және болашақ мансапты таңдау жауапкершілігімен байланысты. Дегенмен, барлық жастағы оқушылар стресстік жағдайларға тап болады, сондықтан мектеп оқушыларында стресске төзімділік дағдыларын қалыптастыру, мектеп пен отбасында қолайлы атмосфераны сақтау, сондай-ақ стресстің адам ағзасына әсері туралы хабардар болу деңгейін арттыру маңызды. Осыған сүйене отырып, біздің жұмысымыздың нәтижесі стресстің адам ағзасына әсері туралы хабардарлықты арттыруға ықпал ететін, сонымен қатар стресске төзімділікті дамыту әдістерін ұсынатын сайтты әзірлеу болды. Осылайша,",
          Conclusionn:"Және ұсыныстар",
          Conclusionnn:"Қорытынды",
          Conclusionnnn:"Оқушыларға",
          Conclusionnnnn:"Ата-аналарға",
          Conclusionnnnnn:"Мұғалімдерге",
          Recommendationsforstudents:"Оқушыларға ұсыныстар",
          Recommendationsforstudentsto:"Денсаулығыңызға сергек болу, мазасыздық пен ашуланшақтықты елемеу, уақытты пайдалануды үйрену, оқу мен демалысты кезектестіру, өзіңізді шамадан тыс жүктемеу, серуендеуге, ұйықтауға және хоббиге уақыт қалдыру, достарыңызбен және жақындарыңызбен ой бөлісу, өйткені қолдау стрессті жеңудің маңызды бөлігі болып табылады, өзіңізге уақыт бөліңіз — ұйқы, қозғалыс және тамақтану ұйқының болмауы денсаулыққа шамадан тыс жүктемеден гөрі көбірек әсер ететінін ескере отырып, стресске төзімділіктің негізі мұғалімдерден көмек сұраудан қорықпаңыз, өйткені қолдау сұрау әлсіздік емес, жетілген қадам.",
          Recommendationsforparenst:"Ата-аналарға арналған ұсыныстар",
          Recommendationsforparenstto:"Стресс жағдайында жасөспірімнің жас ерекшеліктерін ескеру, ішкі жанжалдармен күресуге көмектесу, тіпті олар ұсақ-түйек болып көрінсе де, үйде эмоционалды қауіпсіздік атмосферасын құру, баланың тәжірибесімен бөлісуден қорықпау, жасөспірімнің өзін-өзі реттеу және рефлексия дағдыларын дамыту, оның стресстік реакциясын талдауға көмектесу, баланың денсаулығына мұқият болу және созылмалы шаршау немесе шаршау кезінде мазасыздық маманға хабарласыңыз, баланың өміріне эмоционалды түрде араласыңыз және бірге көбірек уақыт өткізіңіз.",
          Recommendationsforteacher:"Пән мұғалімдеріне ұсыныстар",
          Recommendationsforteacherto:"Ашуланшақтық пен мазасыздықты көрсететін оқушыларға түсіністікпен қарау, өйткені бұл жаман мінез-құлықтан гөрі стресстің белгісі болуы мүмкін, оқушыларға жайлы психологиялық атмосфера құру арқылы қолдау көрсету, ақпараттың шамадан тыс жүктемесінен аулақ болу, әр оқушының әлеуетін ескеру, оқушыларды тек жетістікке емес, күш-жігерге қолдау көрсету,олардың күш-жігерін мойындау және қателіктер қабылдау, бұл қорқынышпен күресуге көмектеседі және стресске төзімділікке ықпал етеді, қолдау мен талапшылдық арасындағы тепе-теңдікті сақтайды, осылайша оқушы әрқашан мұғалімнен көмек сұрай алатынын түсінеді.",

          //* section 3
          Diagramone:"Диаграмма 1",
          D:"5 сынып",
          Dd:"1. Сіз қаншалықты жиі уайымдайсыз?",
          Ddd:"2. Сіз қашан қатты уайымдайсыз?",
          Dddd:"3. Сіз уайымдаған кезде не сезінесіз?",
          Ddddd:"4. Сіз уайымдаған кезде не істейсіз?",
          Dddddd:"5. Сізге қайтадан көңілді болуға не көмектеседі?",

          //* section 4
          Diagramon:"Диаграмма 2",
          T:"7 сынып",
          Tt:"1. Сіз жиі уайымдайсыз ба?",
          Ttt:"2. Сіз қай сәттерде стрессті жиі сезінесіз?",
          Tttt:"3. Сіз бастан өткергенде не сезінесіз?",
          Ttttt:"4. Сіз стрессті қалай басқарасыз?",
          Tttttt:"5. Стресстен кейін тыныштандыруға не көмектеседі?",

          //* section 5
          Diagramo:"Диаграмма 3",
          M:"10 сынып",
          Mm:"1. Сіз қаншалықты жиі стрессті сезінесіз?",
          Mmm:"2. Қандай жағдайлар көбінесе стрессті тудырады?",
          Mmmm:"3. Сіз бастан өткергенде не сезінесіз?",
          Mmmmm:"4. Стресстік жағдайда қандай шаралар қолданасыз?",
          Mmmmmm:"5. Стрессті жеңуге не көмектеседі?",



        },
      
        en: {
          //* header
          theory: "“Theory”",
          practice: "“Practice”",
          classification: "Classification of Stress",
          forms: "Forms of Stress",
          types: "Types of Stressors",
          stages: "Stages of Adaptation to Stress",
          phases: "Phases of Stress",
          info: "General Information about Stress and Techniques",
          stressors: "Types of stressors",
          adaptation:"Stages of Adaptation to Stress",
      
          //* section 1
          influence: "THE EFFECT OF STRESS ON THE HUMAN BODY",
          aboutstress: "What is stress?",
          aboutstressinfo:"Stress (tension) is understood as a set of non-specific adaptive reactions of the body to the influence of various unfavorable factors (physical or psychological). All processes in the human body are subject to psychoemotional state. The appearance of stress in the human body disrupts homeostasis, the state of the nervous system, etc.",
          hans:"HANS SELLE'S RESEARCH",
          selye:"Thanks to Hans Selye's observations, the term Biological Stress Theory emerged. Hans Selye's model of the general adaptation syndrome provides an explanation for how the body responds to and adapts to stress. In his research, Selye noted that, from a biological perspective, the body adapts to external stressors in order to restore and maintain homeostasis. To maintain internal balance, the body activates a humoral system that helps it cope with stress. The primary goal of the general adaptation syndrome is to help the body fight stress. Another result of Selier's analysis is the proof that stress reactions have their limits. When the body is frequently exposed to stress, the energy reserves for dealing with stressors decrease, leading to exhaustion.",
          classificationofstress: "Classification of stress",
          everydaystress: "Everyday stress",
          everydaystressto:"the body's reaction to minor events in everyday life",
          emotionalstress: "Emotional stress",
          emotionalstressto:"a response to overstrain of the nervous system",
          occupationalstress:"Occupational stress",
          occupationalstressto: "a multifaceted phenomenon that manifests itself in psychological or physical reactions to stressful situations in the workplace",
          informationstress: "Information stress",
          informationstressto: "a condition that occurs as a result of information overload",

          //* section2
          formsofstress:"Forms of stress",
          formsofstressto:"In medicine, physiology, and psychology, there are positive (eustress) and negative (distress) forms of stress.",
          Eustress:"Eustress",
          Eustressto:"Useful stress. Stress can be beneficial if it tones up the body's functioning and helps to mobilize the body's defenses. Examples include preparing for an important event, such as an exam or a performance, which, despite the initial tension, brings pleasure and joy in the end result. Eustress is typically short-lived and disappears once the stress is over, leaving a positive impact.",
          Distress:"Distress",
          Distressto:"This is a harmful, negative type of stress that the human body is unable to cope with. It can lead to mental health issues and even severe mental illnesses. This type of stress is associated with situations that are perceived as threats and have a negative impact on physical and mental health. Examples include chronic work-related problems, conflicts in personal relationships, financial difficulties, or serious illnesses. In everyday language, when someone is said to be experiencing stress, it typically refers to excessive stress or distress. At the same time, stress is a reaction to a stressor (an extreme irritant), not to any irritant in general.",
          
          //* section 3
          Typesofstressors:"Types of stressors",
          Typesofstressorsto:"There are physiological and psychological stressors.",
          Physiologicalstressors:"Physiological stressors",
          Physiologicalstressorsto:"They have a direct effect on body tissues. These include pain, cold, high temperature, excessive physical exertion, and more.",
          Biological:"Biological (physiological stress)",
          Biologicalto:"It is characterized by a disruption of homeostasis and is caused by the direct action of an adverse stimulus on the body. Among the factors that cause these disorders, the most well-known are hunger, hypothermia, thirst, circulatory disorders, respiratory disorders, disorders of the nervous system, etc.",
          Psychologicalstressors:"Psychological stressors",
          Psychologicalstressorsto:"These are stimuli that signal the biological or social significance of events. They are signals of threat, danger, anxiety, resentment, and the need to solve a complex problem.",
          Psychologicalstress:"Psychological stress",
          Psychologicalstressto:"human reaction to the peculiarities of interaction between the individual and the surrounding world in works (according to R. Lazarus, R. Laniere). Psychological stress is caused by signal stimuli. It appears in situations of threat, offense, etc., as well as in so-called conflict situations in which animals and humans cannot satisfy their biological or social needs for a long time.",

          //* section 4
          Observations:"Observations by Hans Selye",
          Observationsto:"And the stages of adapting to stress.",
          Observationstoo:"Thanks to Hans Selye's observations, the term Biological Stress Theory was coined. Hans Selye's model of the general adaptation syndrome provides an explanation for how the body reacts to and adapts to stress. In his research, Selye noted that, from a biological perspective, the body adapts to external stressors in order to restore and maintain homeostasis. There are three distinct stages in biological adaptation, or the process of adapting to stress.",
          Stageone:"Stage one",
          Stageonee:"The anxiety stage",
          Stageoneee:"At this stage, the body encounters a non-specific factor and tries to adapt to it. The danger mode is activated: it's too cold, too scary, painful, dangerous, etc. The body then mobilizes and activates self-regulatory mechanisms. If the defense mechanisms are effective and the stressor is reduced or eliminated, the body returns to a normal state, and the anxiety subsides. Most stressors are resolved at this stage.",
          Stagetwo:"Stage two",
          Stagetwoo:"The stage of adaptation.",
          Stagetwooo:"Adaptation to new conditions takes place. This stage occurs when a stressor is present for an extended period of time, necessitating the maintenance of the body's defense mechanisms. Balanced utilization of adaptive reserves occurs. At this stage, individuals are capable of analyzing and seeking optimal solutions to the situation.",
          Stagethree:"Stage three",
          Stagethreee:"The stage of exhaustion.",
          Stagethreeee:"If the stressor is present for a long time, it leads to depletion of hormonal resources and destruction of adaptation systems. The body's resistance is significantly reduced. This is where stress-related illnesses manifest.",

          //* section 5
          Stressphases:"Stress phases (anabolic and catabolic)",
          Stressphasesto:"The catabolic and anabolic phases refer to the metabolic processes that the body initiates in response to a stressful situation. The catabolic phase is characterized by destruction, while the anabolic phase is characterized by restoration.",
          Stressphasestoo:"In order to maintain internal balance, the body activates a humoral system that helps to cope with stress. The main purpose of the general adaptation syndrome is to help the body fight stress. Another result of Selier's analysis is the proof that stress responses have their limits. When the body is frequently exposed to stress, the energy reserves for dealing with stressors decrease, leading to exhaustion.",
          Thecatabolicphase:"The catabolic phase",
          Thecatabolicphaseto:"the initial phase, in which the heart rate increases, blood pressure rises, breathing rate increases, pupils dilate, and muscle tone increases. During this phase, the human body uses glycogen reserves in the liver and muscles, and then switches to using fat reserves for energy production.",
          Theanabolicphase:"The anabolic phase",
          Theanabolicphaseto:"prolongation of the catabolic phase, during which the human body restores damaged structures, tissues, and replenishes ATP energy reserves.продление катаболической фазы, в этой фазе в организме человека восстанавливаются нарушенные структуры, поврежденные ткани и восполняются запасы энергии АТФ.",

          //* section 6
          Generalinformationaboutstressandtechniques:"General information about stress and techniques.",
          Generalinformationbutton1:"Processes in the body <br> during stress",
          Generalinformationbutton2:"Stress as a phenomenon",
          Generalinformationbutton3:"How we <br> perceive stress",
          Generalinformationbutton4:"Stress management methods",
          Whathappensinthebodyduringstress:"What happens to the body during stress?",
          Whathappensinthebodyduringstressto:"Stress is not just a feeling. Stress is an innate physical response that affects the entire body. Prolonged stress can damage many organs and cells throughout the body. The body's response to stress, whether physical or psychological, begins in the brain, where the neuroendocrine system is activated. The part of the neuroendocrine system involved in hormone production is known as the hypothalamic-pituitary-adrenal (HPA) axis. The HPA axis is directly connected to the pituitary gland, which is the central link between the brain and the endocrine system. The hypothalamus releases corticotropin-releasing hormone, which activates the pituitary gland on the axis. During stress, the neuroendocrine system releases adrenocorticotropic hormone (ACTH) into the bloodstream. ACTH stimulates the adrenal cortex to release two hormones: norepinephrine and epinephrine. These sympathomimetic compounds, which are responsible for stimulating the organ to action, initiate the sympathetic nervous system, resulting in an increased heart rate.",
          Stressisacomplexphenomenon:"Stress is a complex phenomenon",
          Stressisacomplexphenomenonto:"It includes physiological, behavioral, subjective, and socio-psychological reactions. Studying only individual aspects leads to a loss of holistic understanding, which is why the focus is now on their interconnectedness. Research shows that psychological experiences are directly linked to physiological changes in the body, with the levels of catecholamines, such as adrenaline and norepinephrine, in the blood correlating with emotions. Adrenaline is associated with anxiety and fear, while norepinephrine is linked to determination or anger. Stress suppresses the immune system, increasing the risk of infections, autoimmune disorders, and tumor growth. Cortisol, which is released during stress, reduces the body's defenses. Severe and prolonged stress can lead to heart problems, such as lipid peroxidation, which damages heart muscle cells. Fatigue and monotonous activities can be reflected in the EEG, with a shift towards lower frequencies indicating reduced brain activity. In summary, it is important to focus on the following points:",
          Perceptionofstress:"Perception of stress",
          Perceptionofstressto:"Stress is not about what happened to you, but how you perceive it. If we turn on our stress response too often or can't turn it off after an event, it can become destructive. One of the most compelling pieces of evidence that many serious illnesses are caused by excessive stress is Robert Sapolsky's book Why Zebras Dont Get Heart Attacks. In the book, theres an example of an experiment where zebras experience an adrenaline and cortisol rush when theyre in a real danger, and then they rest. An example from the book: When a zebra is fleeing from a lion, it experiences severe stress, which causes its heart rate to increase, blood pressure to rise, and blood to flow away from its gastrointestinal tract and towards its muscles. However, as soon as the threat disappears, such as when the lion changes its mind and runs away, the zebras physiology returns to normal within a few minutes. It then continues grazing peacefully in the meadow as if nothing had happened. However, domestic animals, due to the lack of a natural way out of stressful situations, continue to experience",
          Stressmanagementmethods:">Stress management methods",
          Stressmanagementmethodss:"Relaxation techniques",
          Stressmanagementmethodsss:"Relaxation techniques are therapeutic exercises designed to help people reduce tension and anxiety. In addition to psychological effects, stress can cause physiological reactions such as increased heart rate, sweating, shortness of breath, and muscle tension. Relaxation techniques can help reduce these unpleasant reactions.",
          Square:"There are many methods for dealing with stress, and one of the most well-known and simple ones is square breathing.",
          Squaree:"square breathing",
          Squareee:"This method can be used by the patient in various circumstances, both before and after a stressful situation, and it does not require a calm environment to be effective. The essence of the method is that each phase of the breathing cycle lasts the same amount of time, such as 2-4 seconds. The goal of this technique is to activate the parasympathetic nervous system, which is responsible for maintaining a calm state in the body.",
          Method:"For emotional arousal and anxiety, experts recommend the 5 4 3 2 1 method.",
          Methodd:"the 5 4 3 2 1 method",
          Methoddd:"The technique helps to distract a person from anxious thoughts and focus on reality through the use of the five senses: sight, touch, hearing, smell, and taste. First, name five things you can see, either out loud or in your mind. You can also focus on the shape and color of the objects for added effectiveness. Then, touch four objects around you to shift your focus to your sense of touch. Next, identify three things you can hear, focusing on the sounds without trying to amplify or suppress them. After that, name two smells that you can smell; if there are no smells, record their absence. Pay attention to a thing that you could taste; it doesn't have to be something you're eating, just imagine the taste. Finish the technique with ten deep breaths in and out. These techniques can only be used in cases of anxiety disorders or emotional instability, but if you experience severe or frequent anxiety, methods like square breathing or",

          //! 2 page

          //* header
          burger1:"The survey",
          burger2:"Conclusion and recommendations",
          burger3:"chart-1",
          burger4:"chart-2",
          burger5:"chart-3",

          //* section 1
          class:"(5th - 7th - 10th grades)",
          classs:"Survey among students",
          buutton:"results",
          buuttonn:"5th grades",
          buuttonnn:"7th grades",
          buuttonnnn:"10th grade",
          Thegeneralcourseoftheinvestigation:"The general course of the investigation",
          Thegeneralcourseoftheinvestigationto:"In the 2025 academic year, we conducted a study aimed at examining the level of stress among students of different age groups. The goal of our research was to identify the factors that influence the development of stress reactions among students. Through our observations and analysis, we noticed that age has a direct impact on the manifestation of stress. The process of transitioning from one grade to another increases the level of anxiety and emotional tension among students. As students enter middle school, their social environment undergoes significant changes. They face a range of changes in their social environment, including the replacement of teachers, the introduction of new subjects, and the implementation of a classroom system. The form of communication with teachers changes: they become stricter and more demanding, and there is no emotional connection like with a class teacher in elementary school. Middle school is considered a transitional period, as it lies between childhood and adolescence. At this age, hormonal changes occur, and puberty begins. There are also changes in the educational process.",
          fivethgraderesults:"5th grade results",
          fivethgraderesultsto:"See diagram 1",
          fivethgraderesultstoo:"The results of the survey showed that among fifth-grade students, when asked How often do you worry?, most students (54%) chose the option sometimes, 19% - often, 21% - rarely and only 6% - never. According to the results, it can be concluded that fifth-graders regularly experience stress, but its level does not reach constant emotional tension. Most often, the cause of stress was study and evaluation: tests and control works - 29%, bad grades - 29%. The results indicate that the main factors causing stress in schoolchildren are the fear of mistakes and social pressure. One of the most common reactions to a stressful situation is rapid heartbeat (30%) and fear (21%). Less common reactions are anger (8%), the desire to cry (13%), abdominal pain and headache (9%), trembling in the body were chosen by 3% of students. Due to their age, fifth graders do not always understand what is happening to them. It is difficult for children to connect physical sensations with emotions.",
          seventhgraderesults:"7th grade results",
          seventhgraderesultsto:"See diagram 2",
          seventhgraderesultstoo:"When asked how often students experience stress, the majority of seventh-graders (46%) chose the option often. Another 18% answered sometimes and rarely, while 19% chose almost never. Based on these data, it can be concluded that, unlike in elementary school, stress is more frequent in middle school. Similar to elementary school, frequent stressors include tests (35%) and poor grades (35%). Less common are stressful situations related to answering at the blackboard (23%) and communicating with classmates (6%). Thus, the stress of seventh-graders is mainly related to academic workload. The most common reaction to stressful situations is increased heart rate (28%). Sadness and withdrawal are also common (22%). Headaches and abdominal pain (12%), anger (9%), and shortness of breath (8%) are the least common. The high percentage of those who dont feel anythin indicates emotional immaturity. When asked about how students cope with stress",
          tenthgraderesults:"10th grade results",
          tenthgraderesultsto:"See diagram 3",
          tenthgraderesultstoo:"More than half of tenth-grade students experience stress often or sometimes (31%). Another 21% chose the rarely option, and only 17% reported that they never experience stress, indicating that one in three students regularly faces stress. The main causes of stress for high school students include tests and quizzes (51%), class presentations (21%), and, less frequently, poor grades (15%) and difficulties in socializing with classmates (13%). The most common reactions are heart palpitations (27%), sadness and detachment (20%), aggression (18%), and difficulty breathing (17%) and no symptoms (18%) are less common. Most students (38%) prefer to withdraw and spend time alone, 28% share with friends, and only 6% turn to adults. Communication (25%) is the primary way to reduce stress, with music and games (14%), food, and sports as secondary methods (12%). High school students also consult a psychologist (2%) and practice breathing exercises.",

          //* 2 section
          Conclusion:"Conclusion",
          Coonclusion:"Based on the literature review and the analysis of the questionnaire data of students of grades 5, 7 and 10, it was found that stress is an integral part of the life of students of all ages. However, its frequency, causes and ways of coping differ depending on the age. The results of the questionnaire confirmed our hypothesis: the highest level of stress is observed in high school students, which is associated with increased academic load due to exams and the responsibility for choosing a future career. However, students of all ages face stressful situations, so it is important to develop stress-resistant skills in students, maintain a positive school and family environment, and raise awareness about the effects of stress on the human body. Based on this, we have developed a website that promotes awareness about the effects of stress on the human body and provides methods for developing stress-resistant skills.",
          Conclusionn:"And recommendations",
          Conclusionnn:"Conclusion",
          Conclusionnnn:"Students",
          Conclusionnnnn:"Parents",
          Conclusionnnnnn:"Teachers",
          Recommendationsforstudents:"Recommendations for students",
          Recommendationsforstudentsto:"Be vigilant about your health, don't ignore anxiety and irritability, learn to manage your time, alternate between studying and relaxing, don't overburden yourself, make time for walks, sleep, and hobbies, share your thoughts with friends and family, as support is an important part of managing stress, take care of yourself - sleep, exercise, and nutrition are the foundation for stress resilience, considering that sleep deprivation has a greater impact on health than academic overload, don't be afraid to ask for help from your teachers, as seeking support is not a sign of weakness but a mature step.",
          Recommendationsforparenst:"Recommendations to parents",
          Recommendationsforparenstto:"Take into account the age-related characteristics of a teenager under stress, help them cope with internal conflicts, even if they seem insignificant, create an atmosphere of emotional safety at home so that the child is not afraid to share their feelings, develop self-regulation and reflection skills in the teenager, help them analyze their reactions to stress, pay attention to the child's health, and consult a specialist in case of chronic fatigue or anxiety, be emotionally involved in the child's life, and spend more time together.",
          Recommendationsforteacher:"Recommendations for subject teachers",
          Recommendationsforteacherto:"To treat students who are irritable and anxious with understanding, as this may be a sign of stress rather than bad behavior, to support students by creating a comfortable psychological environment, to avoid excessive information overload, to consider each student's potential, to support students for their efforts rather than just their successes, to acknowledge their efforts and accept their mistakes, which helps them cope with fear and promotes resilience, and to strike a balance between support and demandingness, ensuring that students understand that they can always seek help from their teachers.",

          //* section 3
          Diagramone:"Diagram 1",
          D:"5th grade",
          Dd:"1. How often do you get worried?",
          Ddd:"2. When do you worry the most?",
          Dddd:"3. How do you feel when you're worried?",
          Ddddd:"4. What do you do when you're worried?",
          Dddddd:"5. What helps you become cheerful again?",

          //* section 4
          Diagramon:"Diagram 2",
          T:"7th grade",
          Tt:"1. Do you get nervous often?",
          Ttt:"2. When do you feel stressed the most?",
          Tttt:"3. What do you feel when you're worried?",
          Ttttt:"4. How do you deal with stress?",
          Tttttt:"5. What helps you calm down after stress?",

          //* section 5
          Diagramo:"Diagram 3",
          M:"10th grade",
          Mm:"1. How often do you experience stress?",
          Mmm:"2. What situations cause stress the most?",
          Mmmm:"3. What do you feel when you're worried?",
          Mmmmm:"4. What measures do you take in a stressful situation?",
          Mmmmmm:"5. What helps you cope with stress?",



        }
      };
  
    // применить перевод
    function applyTranslations(lang) {
      document.querySelectorAll("[data-js-lang]").forEach(el => {
        const key = el.dataset.jsLang;
        if (translations[lang][key]) el.innerHTML = translations[lang][key];
      });
    }
  
    // показать/скрыть меню языков
    mainButton.addEventListener("click", (e) => {
      e.stopPropagation();
      langContainer.classList.toggle("active");
    });
  
    // выбор языка
    langButtons.forEach(btn => {
      btn.addEventListener("click", () => {
        const lang = btn.dataset.lang;
        mainButton.textContent = btn.textContent;
        mainButton.dataset.lang = lang;
        localStorage.setItem("lang", lang);
        langContainer.classList.remove("active");
        applyTranslations(lang);
      });
    });
  
    // загрузка сохранённого языка
    const savedLang = localStorage.getItem("lang") || "ru";
    const savedBtn = [...langButtons].find(btn => btn.dataset.lang === savedLang);
  
    if (savedBtn) {
      mainButton.textContent = savedBtn.textContent;
      mainButton.dataset.lang = savedLang;
    } else {
      mainButton.textContent = "🇷🇺 RU";
      mainButton.dataset.lang = "ru";
      localStorage.setItem("lang", "ru");
    }
  
    applyTranslations(mainButton.dataset.lang);
  
    // закрыть при клике вне меню
    document.addEventListener("click", (e) => {
      if (!langContainer.contains(e.target)) {
        langContainer.classList.remove("active");
      }
    });
  });